spec/fixtures/requests/activate_port/unsigned_no_first_last_name_soap.xml

<soapenv:Envelope
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:v2="http://integration.sprint.com/common/header/WSMessageHeader/v2"
xmlns:sub="http://integration.sprint.com/interfaces/wholesaleActivateSubscriptionWithPortIn/v4/wholesaleActivateSubscriptionWithPortInV4.xsd">
<soapenv:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
</wsse:Security>
<v2:wsMessageHeader>
<v2:trackingMessageHeader>
<v2:applicationId>2222333344</v2:applicationId>
<v2:applicationUserId>BEQUICK</v2:applicationUserId>
<v2:messageId>9999999999</v2:messageId>
<v2:timeToLive>0</v2:timeToLive>
<v2:messageDateTimeStamp>2014-01-01T00:00:00.0Z</v2:messageDateTimeStamp>
</v2:trackingMessageHeader>
</v2:wsMessageHeader>
</soapenv:Header>
<soapenv:Body>
<sub:wholesaleActivateSubscriptionWithPortInV4>
<sub:portInfo>
<sub:authorizedBy></sub:authorizedBy>
<sub:nameInfo>
<sub:individualNameInfo>
<sub:billFirstName></sub:billFirstName>
<sub:billLastName></sub:billLastName>
</sub:individualNameInfo>
</sub:nameInfo>
<sub:billStreetNumber>123</sub:billStreetNumber>
<sub:billStreetName>Test St</sub:billStreetName>
<sub:billStreetDirectionIndicator></sub:billStreetDirectionIndicator>
<sub:billCityName>city</sub:billCityName>
<sub:billStateCode>state</sub:billStateCode>
<sub:zip>
<sub:uspsPostalCd>99999</sub:uspsPostalCd>
</sub:zip>
<sub:accountNumber>999999</sub:accountNumber>
<sub:passwordPin></sub:passwordPin>
</sub:portInfo>
<sub:subscriberInfo>
<sub:mdn>5555555555</sub:mdn>
<sub:deviceInfoList>
<sub:deviceInfo>
<sub:serialNumber>12345678901</sub:serialNumber>
<sub:serialType>E</sub:serialType>
</sub:deviceInfo>
</sub:deviceInfoList>
<sub:csa>MIAWPB561</sub:csa>
<sub:pricePlan>
<sub:serviceCode>TESTPLAN</sub:serviceCode>
</sub:pricePlan>
<sub:serviceList>
<sub:serviceRecord>
<sub:serviceCode>TESTNVM</sub:serviceCode>
</sub:serviceRecord>
<sub:serviceRecord>
<sub:serviceCode>TESTPMVM</sub:serviceCode>
</sub:serviceRecord>
<sub:serviceRecord>
<sub:serviceCode>TESTINTCL</sub:serviceCode>
</sub:serviceRecord>
</sub:serviceList>
<sub:fetchDeviceDetailInfo>true</sub:fetchDeviceDetailInfo>
</sub:subscriberInfo>
</sub:wholesaleActivateSubscriptionWithPortInV4>
</soapenv:Body>
</soapenv:Envelope>
