spec/fixtures/requests/modify_port/unsigned_soap.xml

<soapenv:Envelope
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:v2="http://integration.sprint.com/common/header/WSMessageHeader/v2"
xmlns:sub="http://integration.sprint.com/interfaces/WholesaleWnp/v1/PortEnvelope.xsd">
<soapenv:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
</wsse:Security>
<v2:wsMessageHeader>
<v2:trackingMessageHeader>
<v2:applicationId>2222333344</v2:applicationId>
<v2:applicationUserId>BEQUICK</v2:applicationUserId>
<v2:messageId>9999999999</v2:messageId>
<v2:timeToLive>0</v2:timeToLive>
<v2:messageDateTimeStamp>2014-01-01T00:00:00.0Z</v2:messageDateTimeStamp>
</v2:trackingMessageHeader>
</v2:wsMessageHeader>
</soapenv:Header>
<soapenv:Body>
<sub:modifyPortIn>
<sub:mdn>5555555555</sub:mdn>
<sub:timeZone>CST</sub:timeZone>
<sub:billFirstName>new first</sub:billFirstName>
<sub:billLastName>new last</sub:billLastName>
<sub:billStreetNumber>123</sub:billStreetNumber>
<sub:billStreetName>Test St</sub:billStreetName>
<sub:billStreetDirectionIndicator>W</sub:billStreetDirectionIndicator>
<sub:billCityName>city</sub:billCityName>
<sub:billStateCode>state</sub:billStateCode>
<sub:zip>
<sub:uspsPostalCd>new zip</sub:uspsPostalCd>
</sub:zip>
<sub:ssn>999999999</sub:ssn>
<sub:accountNumber>999</sub:accountNumber>
<sub:passwordPin>password</sub:passwordPin>
<sub:remark>remark</sub:remark>
</sub:modifyPortIn>
</soapenv:Body>
</soapenv:Envelope>
